In [1]:
#Import the necessary libraries
import pandas as pd
import numpy as np

In [2]:
#Create 3 differents Series, each of length 100, as follows:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100,
dtype='l'))
print(s1, s2, s3)

0     1
1     2
2     2
3     4
4     4
     ..
95    2
96    1
97    4
98    3
99    3
Length: 100, dtype: int32 0     2
1     1
2     1
3     2
4     2
     ..
95    2
96    3
97    2
98    2
99    2
Length: 100, dtype: int32 0     18379
1     25863
2     20454
3     20293
4     19524
      ...
95    24901
96    15144
97    11581
98    23073
99    13299
Length: 100, dtype: int32

In [3]:
#Let's create a DataFrame by joinning the Series by column
housemkt = pd.concat([s1, s2, s3], axis=1)
housemkt.head()

   0  1      2
0  1  2  18379
1  2  1  25863
2  2  1  20454
3  4  2  20293
4  4  2  19524

In [4]:
#Change the name of the columns to bedrs, bathrs,price_sqr_meter
housemkt.rename(columns = {0: 'bedrs', 1: 'bathrs', 2:
'price_sqr_meter'}, inplace=True)
housemkt.head()

   bedrs  bathrs  price_sqr_meter
0      1       2            18379
1      2       1            25863
2      2       1            20454
3      4       2            20293
4      4       2            19524

In [5]:
#Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'
# join concat the values
bigcolumn = pd.concat([s1, s2, s3], axis=0)
# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

<class 'pandas.core.frame.DataFrame'>

In [6]:
#Oops, it seems it is going only until index 99. Is it true?
# no the index are kept but the length of the DataFrame is 300
len(bigcolumn)

300

In [7]:
#Reindex the DataFrame so it goes from 0 to 299
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        1
1        2
2        2
3        4
4        4
..     ...
295  24901
296  15144
297  11581
298  23073
299  13299

[300 rows x 1 columns]